Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КлиентскаяРаботаСДокументами/Ext/Module.bsl
Процедура СуммаЭлементаТЧ(СТЧ) Экспорт
	
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
	СТЧ.СебестоимостьТовара = СТЧ.ЦенаПокупки * СТЧ.Количество;
	
КонецПроцедуры

Процедура РасчетНДСЭТЧ(СТЧ) Экспорт 
	
	Если СТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		СТЧ.СуммаНДС = СТЧ.Сумма * 20 / 100;
		СТЧ.СуммаСНДС = СТЧ.Сумма + СТЧ.СуммаНДС;
	ИначеЕсли СТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		СТЧ.СуммаНДС = СТЧ.Сумма * 10 / 100;
		СТЧ.СуммаСНДС = СТЧ.Сумма + СТЧ.СуммаНДС;
	ИначеЕсли СТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		СТЧ.СуммаНДС = 0;
		СТЧ.СуммаСНДС = СТЧ.Сумма;
	КонецЕсли;

КонецПроцедуры

Процедура СуммаПриходТЧ(СТЧ) Экспорт 
	
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
		
КонецПроцедуры
